Table of Contents
 Interface IIdeaCrossSectionByParameters
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A cross-section defined by parameters.
public interface IIdeaCrossSectionByParameters : IIdeaCrossSection, IIdeaObject
Inherited Members
 IIdeaCrossSection.Rotation
 IIdeaCrossSection.IsInPrincipal
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Material
Material of the cross-section.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Parameters
Parameters of the cross-section. Parameters depend of the type of the cross-section. See CrossSectionFactory for more information about parameters.
HashSet<Parameter> Parameters { get; }
Property Value
HashSet<Parameter>
 Type
Type of the cross-section.
CrossSectionType Type { get; }
Property Value
CrossSectionType
 Edit this page